spec/fixtures/infakt/invoice_list.json

{
   "invoices":[
      {
         "zaplacono":0.0,
         "client_kod_pocztowy":"12345",
         "data_wystawienia":"2012-03-30",
         "podpis_odbiorcy":null,
         "client_id":999999,
         "uwagi":"VAT rozlicza nabywca - reverse charge",
         "status":"zapłacona",
         "client_miejscowosc":"Hamburg",
         "podpis_sprzedawcy":"Krzysztof Jabłoński",
         "client_panstwo":"Niemcy",
         "waluta":"EUR",
         "data_sprzedazy":"2012-03-30",
         "numer_faktury_korygowanej":null,
         "invoice_id":123456,
         "client_nip":"DEXXXXXXXXX",
         "termin_zaplaty":"2012-04-13",
         "razem_netto":9999.0,
         "data_faktury_korygowanej":null,
         "data_podpisania":null,
         "client_nazwa_firmy":"Company GmbH",
         "razem_vat":0.0,
         "rodzaj_faktury":"Faktura VAT",
         "client_ulica":"Str. 12/11",
         "razem_brutto":9999.0,
         "services":[
            {
               "cena_netto":9999.0,
               "jm":"",
               "wartosc_netto":9999.0,
               "ilosc":1.0,
               "product_id":12345,
               "nazwa":"Nazwa usługi",
               "service_id":12345678,
               "stawka_vat":"np",
               "wartosc_brutto":9999.0,
               "vat":0.0,
               "symbol":"",
               "marza":0
            }
         ],
         "numer":"1/2011",
         "sposob_platnosci":"Przelew"
      }
   ],
   "info":{
      "pages":1,
      "total":1,
      "per_page":1,
      "page":1
   }
}
